examples/tumor_chip_linear_gradient/data/cases/run_opposing_none_H200_1776929274902/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_drug
    {
        type            fixedValue;
        value           uniform (0.172242 0.000000 0.000000);
    }

    inlet_medium
    {
        type            fixedValue;
        value           uniform (0.056496 0.000000 0.000000);
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            noSlip;
    }

    floor
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
